snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/УведомленияОПоступившихПлатежах/УведомленияОПоступившихПлатежах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомленияОПоступившихПлатежах</name>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ObjectModule.bsl
#Область СобытияОбъекта

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной") + "-";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УИД_СтрокиПлатежа = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЭтоНовый() Тогда
		РеквизитыДоИзменения = ПолучитьРеквизитыШапки(Ссылка, "ПометкаУдаления,Проведен,Дата,СуммаДокумента,Контрагент,Договор");
		ДополнительныеСвойства.Вставить("РеквизитыДоИзменения", РеквизитыДоИзменения);	
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)                  
	Если ИзменилисьКлючевыеРеквизиты() Тогда
		РегистрыСведений.УведомленияОПоступившихПлатежах.УдалитьУведомление(Ссылка);			
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

Функция ИзменилисьКлючевыеРеквизиты()
	Результат = Ложь;
	
	РеквизитыДоИзменения = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "РеквизитыДоИзменения");	
	Если ТипЗнч(РеквизитыДоИзменения) = Тип("Структура") Тогда
		Для каждого КиЗ Из РеквизитыДоИзменения Цикл
			Если КиЗ.Значение <> ЭтотОбъект[КиЗ.Ключ] Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ИзменилисьКлючевыеРеквизиты()
